package com.xms.basic.day08;
/***
 * 面向对象三大特性：封装，继承，多态
 * 		1.封装：方法的封装，类的封装（组件--可以供某种方法重复调用）
 * 		意义：	
 * 			1.对外部提供可供调用的稳定的功能
 * 			2.降低代码的出错率，提高代码的服用性和可维护性
 * 			3.当封装的方法内部出现细节改变时，只要保持对外的功能不变，
 * 				其他模块不会受到影响
 * 	注意：
 * 		一个.java文件中可以写多个class,但是只能有一个public修饰的
 * 		class且public修饰的class必须和文件名相同		
 * 
 * 
 * 		JavaBean概念:实际上就是以某种规范封装好的java类(可重用的组件)
 * 						规范：
 * 								1.类具体且公开	，必须有无参数的构造方法
 * 								2.数据私有
 * 								3.方法公开
 * 
 * 
 * @author Administrator
 *
 */
public class Demo01 {

}
//class Demo02{
//	
//}
//class Demo03{
//	
//}






















